# Homework 3
# Создайте переменные разных типов данных:
#  - Создайте переменную name и присвойте ей значение вашего имени (строка).
#  - Выведите значение переменной name на экран.
#  - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#  - Выведите значение переменной age на экран.
#  - Перезапишите в age текущее значение переменной age + новое.
#  - Выведите измененное значение переменной age на экран.
#  - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#  - Выведите значение переменной is_student на экран.

name = "Ivan"
print(f"Name: {name}")

age = 30
print(f"Age: {age}")

age += 5
print(f"New age: {age}")

is_student = True
print(f"Is Student: {is_student}")
